// 本文档为全局配置文档

    // ajax请求接口
    url="";
    var _g = {


    }
    // 表单验证
    var rule = {
        userName : {
            // 此正则表达式将上面二者结合起来进行判断，中文、大小写字母和数字，{2，10}字符的长度为2-10**/
            Name:/^[\\u4E00-\\u9FA5\\uF900-\\uFA2D\\w]{2,10}$/
        },
        userPassWord :{
            //密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字
            passWord : /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/
        },
        userEmail : {
            // 邮箱验证
            email : /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/
        },
        userIphone : {
            //手机号验证
            iphone: /^1[345789]\d{9}$/g
        },
        userId:{
            //身份证号验证
            id:/^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/
        },
        userCarId:{
            //用户车牌验证
            carId:/^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/
        },  
    }